performance/users.yaml
config:
  target: 'http://localhost:4000'
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: 'Warm up'
#    - duration: 20
#      arrivalRate: 5
#      rampTo: 50
#      name: 'Ramp up load'
  payload:
    path: 'users.csv'
    fields:
      - 'usernames'
scenarios:
  - flow:
      - post:
          url: '/login'
          json:
            login: 'admin'
            password: 'admin'
          capture:
            - json: '$.token'
              as: 'token'
      - post:
          url: '/users'
          headers:
            Authorization: 'Bearer {{ token }}'
          json:
            name: '{{ usernames }}'
            login: '{{ usernames }}'
            password: '{{ usernames }}'
          capture:
            - json: '$.id'
              as: 'userId'
      - get:
          url: '/users/{{ userId }}'
          headers:
            Authorization: 'Bearer {{ token }}'
      - put:
          url: '/users/{{ userId }}'
          headers:
            Authorization: 'Bearer {{ token }}'
          json:
            name: '{{ usernames }}1'
            login: '{{ usernames }}1'
            password: '{{ usernames }}1'
      - delete:
          url: '/users/{{ userId }}'
          headers:
            Authorization: 'Bearer {{ token }}'